In [125]:
import pandas as pd

In [126]:
# create a 2D Dictionary
items={'Bob':pd.Series([245,25,55],index=['bikes','pant','watch']),
       'Alice':pd.Series([40,110,50,45],index=['book','glass','bikes','pant'])}
type(items)

dict

In [127]:
shopping_carts=pd.DataFrame(items)
shopping_carts

         Bob  Alice
bikes  245.0   50.0
book     NaN   40.0
glass    NaN  110.0
pant    25.0   45.0
watch   55.0    NaN

In [128]:
# create a 2D dictionary without index labels
data={'Bob':pd.Series([245,25,55]),
     'Alice':pd.Series([40,110,50,45])}
df=pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0     50
3    NaN     45

In [129]:
# index
shopping_carts.index

Index(['bikes', 'book', 'glass', 'pant', 'watch'], dtype='object')

In [130]:
#column
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [131]:
#value
shopping_carts.values

array([[245.,  50.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [132]:
#shape
shopping_carts.shape

(5, 2)

In [133]:
# no.of dimension
shopping_carts.ndim

2

In [134]:
#size
shopping_carts.size

10

In [135]:
# load data only from bob shopping_carts
bob_shopping_cart = pd.DataFrame(items,columns=['Bob'])
bob_shopping_cart

       Bob
bikes  245
pant    25
watch   55

In [136]:
#selected intems
sel_shopping_cart=pd.DataFrame(items,index=['pant','book'])
sel_shopping_cart

       Bob  Alice
pant  25.0     45
book   NaN     40

In [137]:
#selected items from alice shopping cart
alice_sel_shopping_cart=pd.DataFrame(items,index=['glass','bike'],columns=['Alice'])
alice_sel_shopping_cart

       Alice
glass  110.0
bike     NaN

In [138]:
data = {'integer':[1,2,3],
       'float':[4.5,8.5,9.6]}
df=pd.DataFrame(data,index=['label1','label2','label3'])
df

        integer  float
label1        1    4.5
label2        2    8.5
label3        3    9.6

In [139]:
# manually create pandas data dictionary using python dictionaries
items=({'bikes':20,'pants':30,'watches':35},{'watches':10,'glasses':50,'bikes':15,'pants':5})
store_items=pd.DataFrame(items,index=['label1','label2'])
store_items

        bikes  pants  watches  glasses
label1     20     30       35      NaN
label2     15      5       10     50.0

In [140]:
# access bike column using column label
store_items[['bikes']]

        bikes
label1     20
label2     15

In [141]:
# access multiple column
store_items[['pants','watches']]

        pants  watches
label1     30       35
label2      5       10

In [142]:
# access row using row label
store_items.loc[['label1']]

        bikes  pants  watches  glasses
label1     20     30       35      NaN

In [143]:
# specific value row & column
store_items['bikes']['label1']

20

In [144]:
# add a new column
store_items['shirts']=[15,2]
store_items

        bikes  pants  watches  glasses  shirts
label1     20     30       35      NaN      15
label2     15      5       10     50.0       2

In [145]:
store_items['suits']=store_items['pants']+store_items['shirts']
store_items

        bikes  pants  watches  glasses  shirts  suits
label1     20     30       35      NaN      15     45
label2     15      5       10     50.0       2      7

In [146]:
# create a new dataframe for a row
new_items=[{'bikes':20,'pants':30,'watches':35,'glasses':4}]
new_store=pd.DataFrame(new_items,index=['label3'])
new_store

        bikes  pants  watches  glasses
label3     20     30       35        4

In [147]:
# joint the column
store_items=store_items.append(new_store)
store_items

        bikes  glasses  pants  shirts  suits  watches
label1     20      NaN     30    15.0   45.0       35
label2     15     50.0      5     2.0    7.0       10
label3     20      4.0     30     NaN    NaN       35

In [148]:
# insert  a new column
store_items.insert(5,'shoes',[8,5,0])
store_items

        bikes  glasses  pants  shirts  suits  shoes  watches
label1     20      NaN     30    15.0   45.0      8       35
label2     15     50.0      5     2.0    7.0      5       10
label3     20      4.0     30     NaN    NaN      0       35

In [149]:
# delete a column using axis=1
store_items=store_items.drop(['watches','shoes'],axis=1)
store_items

        bikes  glasses  pants  shirts  suits
label1     20      NaN     30    15.0   45.0
label2     15     50.0      5     2.0    7.0
label3     20      4.0     30     NaN    NaN

In [150]:
# delete a row using axis=0
store_items=store_items.drop('label1',axis=0)
store_items

        bikes  glasses  pants  shirts  suits
label2     15     50.0      5     2.0    7.0
label3     20      4.0     30     NaN    NaN

In [151]:
# rename a column
store_items=store_items.rename(columns={'bikes':'hats'})
store_items

        hats  glasses  pants  shirts  suits
label2    15     50.0      5     2.0    7.0
label3    20      4.0     30     NaN    NaN

In [152]:
# rename a row
store_items=store_items.rename(index={'label3':'last label'})
store_items

            hats  glasses  pants  shirts  suits
label2        15     50.0      5     2.0    7.0
last label    20      4.0     30     NaN    NaN

In [153]:
store_items['suits']=store_items['pants']+store_items['shirts']
store_items

            hats  glasses  pants  shirts  suits
label2        15     50.0      5     2.0    7.0
last label    20      4.0     30     NaN    NaN

In [154]:
# calculate NaN value
x =store_items.isnull().sum()#.sum()
print(x)

hats       0
glasses    0
pants      0
shirts     1
suits      1
dtype: int64

In [155]:
# delete a row with nan value
store_items.dropna(axis=0)

        hats  glasses  pants  shirts  suits
label2    15     50.0      5     2.0    7.0

In [156]:
# delete a column with nan value
store_items.dropna(axis=1)

            hats  glasses  pants
label2        15     50.0      5
last label    20      4.0     30

In [157]:
# replace nan value
store_items.fillna(1)

            hats  glasses  pants  shirts  suits
label2        15     50.0      5     2.0    7.0
last label    20      4.0     30     1.0    1.0

In [160]:
#fill value from previous row
store_items.fillna(method='ffill',axis=0)

            hats  glasses  pants  shirts  suits
label2        15     50.0      5     2.0    7.0
last label    20      4.0     30     2.0    7.0

In [162]:
# fill value using column axis
store_items.interpolate(method='linear',axis=0)

            hats  glasses  pants  shirts  suits
label2        15     50.0      5     2.0    7.0
last label    20      4.0     30     2.0    7.0